// - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)
function minNum(a,b,c) {
    if(a < b && a < c ){console.log(a)}
else if (b < a && b < c ){console.log(b)}
else if(c < a && c < b ) {console.log(c)}
}
minNum(50, 20, 30)

// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)
function maxNum(a,b,c) {
    if(a > b && a > c ){console.log(a)}
    else if (b > a && b > c ){console.log(b)}
    else if(c > a && c > b ) {console.log(c)}
}
maxNum(50, 20, 30)
// - створити функцію яка повертає найбільше число з масиву
let masiv = [0,5,7,9,6,5];
function masivMax(array) {
let max = 0
for (const number of array) {
    if (number> max){max = number};
}
return max;
}





// let maxArray = [200,3,4,5,6,10,40000,3,600]
// function arrayMax(array) {
//     let max = array[0];
//     for (const element of array) {
//         if(element > max){
//             max = element;
//         }
//     }
//     return max;
// }
// document.write(`<h2>Найбільший елемент масиву: ${arrayMax(maxArray)}</h2>`)

// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.
// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);
// - створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.
// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.
// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].
