// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let  numberOne = +prompt('Введіть перше число.')
// let  numberTwo = +prompt('Введіть друге число.')
//
//
// if (numberOne > numberTwo && numberOne !== numberTwo){alert("Максимальне число:"+" "+numberOne)
// } else if (numberOne === numberTwo) {alert('Два числа є однакові.')
// } else if  (numberOne < numberTwo) {
//     alert("Максимальне число:" + " " + numberTwo)
// }
// else  {alert(`Спробуйте  ввести кожне число ще раз`)}

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let numberOfapartment = +prompt('Вкажіть номер квартири')
// if (numberOfapartment >= 1 && numberOfapartment <= 20) {
//     alert("Ваша квартира знаходиться в першому під'їзді.");
// } else if (numberOfapartment >= 21 && numberOfapartment <= 48) {
//     alert("Ваша квартира знаходиться в другому під'їзді.")
// } else if (numberOfapartment >= 49 && numberOfapartment <= 90) {
//     alert("Ваша квартира знаходиться в третьому під'їзді.")
// } else {
//     alert("Перевірте правильність введення номеру квартири.")
// }


// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = +prompt('Задайте  число')
//     let  constNumber = 10;
// (number === constNumber) ? alert(`Вірно`) : alert(`Невірно`);



// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else


//
// let writeData = 123

// let writeData = 'dfedf'

// let writeData = true
//
// let writeData = myHonda = {
//     color: "red",
//     wheels: 4,
//     engine: {
//         cylinders: 4,
//         size: 2.2
//     }
// };
//
// // let writeData = [1,2,3,4,5,5]
//
//
//
//
//
// if (typeof writeData === 'number') {
//     document.write('це число')
// } else if (typeof writeData === "string") {
//     document.write('це текст')
// } else if (typeof writeData === "object") {
//     document.write('це обєкт')
// } else if (typeof writeData === "boolean") {
//     document.write('це булеве значення')
// } else {
//     document.write('невідоме значення')
// }

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
// let temp = +prompt('Вкажіть темпрературу в градусах, записувати в цифрах.')
//
// (temp >= 10 && temp <=22) ? alert(`Ми йдемо ВЧИТИСЯ`): alert(`сидимо вдома і вчимося ОНЛАЙН`)


    // - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
    // числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let box = +prompt('Виберіть коробку, з відповідним номером і вкажіть номер від 1 до 5')
// switch (box){
//     case 1: {alert('Ви виграли авто.')
//         break;
//     }
//     case 2: {alert('Ви виграли мотоцикл.')
//         break;
//     }
//     case 3: {alert('Ви виграли телефон.')
//         break;
//     }
//     case 4: {alert('Ви виграли годинник.')
//         break;
//     }
//     case 5: {alert('Ви виграли скутер.')
//         break;
//     }
//     default: {alert('Ви ввели неправильне число коробки.')
//         break;}
//
// }




// ADDITTIONAL Task


// Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.



// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]
//  friends.length;
//
// ( friends.length >= 3 ) ? alert(`це великий масив, в якому  3 і більше елементи`) : alert(`це малий  масив, в якому  2 і менше елементи`)



// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.


// alert(Array.from({length:3}).map(x => +prompt("Введите число")).sort((a,b) => a-b)[1])

                           // або
// {
//
//     a=parseInt(prompt("a:"));
//     b=parseInt(prompt("b:"));
//     c=parseInt(prompt("c:"));
//     if((b<a && a<c) || (c<a && a<b)) alert(a);
//     if((a<b && b<c) || (c<b && b<a)) alert(b);
//     if((a<c && c<b) || (b<c && c<a)) alert(c);
// }


// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
//
// (a + b < 4) ? alert(`Мало`) : alert(`Багато`)


//     - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
// {
// let number =  +prompt('Введіть число від -100 до 100')
//
// if (number >= -100 && number <= -1 ){ alert(number+' '+'це негативне число')}
// else if (number >= 1 && number <= 100 ){ alert(number+' '+'це позитивне число')}
// else if (number === 0 ){ alert('це число є нулем')}
// else {alert(`щось пішло не так`)}
// }

// тернарка
let number = +prompt('Введіть число від -100 до 100')
let a = (number >= -100 && number <= -1) ? alert(number + ' ' + 'це негативне число') :
    (number >= 1 && number <= 100) ? alert(number + ' ' + 'це позитивне число') :
        (number === 0) ? alert('це число є нулем') : alert(`щось пішло не так`)


